CYRILLIC_CHARSET = set(
    "абвгдеёжзийклмнопрстуфхцчшщъыьэюя"
    "АБВГДЕЁЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЫЬЭЮЯ"
    "ӘәҒғҚқҢңӨөҰұҮүҺһІі"
)
MONTHS = (
    "қаңтар|ақпан|наурыз|сәуір|мамыр|маусым|шілде|тамыз|қыркүйек|қазан|қараша|желтоқсан"
)
ALPHABET = "а-яА-ЯӘәҒғҚқҢңӨөҰұҮүҺһІі"
ORDINAL_SUFFIX = "інші|ыншы|сыншы|ші|шы"
GROUP_SUFFIX = "дан|ден|тан|тен"
ORDINAL_DICT = {
    # ONES
    "бір": "бірінші",
    "екі": "екінші",
    "үш": "үшінші",
    "төрт": "төртінші",
    "бес": "бесінші",
    "алты": "алтыншы",
    "жеті": "жетінші",
    "сегіз": "сегізінші",
    "тоғыз": "тоғызыншы",
    # TENS
    "он": "оныншы",
    "жиырма": "жиырмасыншы",
    "отыз": "отызыншы",
    "қырық": "қырықыншы",
    "елу": "елуінші",
    "алпыс": "алпысыншы",
    "жетпіс": "жетпісінші",
    "сексен": "сексенінші",
    "тоқсан": "тоқсаныншы",
    # HUNDRED
    "жүз": "жүзінші",
    # THOUSANDS
    "мың": "мыңыншы",
    "миллион": "миллионыншы",
    "миллиард": "миллиардыншы",
    "триллион": "триллионыншы",
    "квадриллион": "квадриллионыншы",
    "квинтиллион": "квинтиллионыншы",
    "секстиллион": "секстиллионыншы",
    "септиллион": "септиллионыншы",
    "октиллион": "октиллионыншы",
    "нониллион": "нониллионыншы",
}
